<a href="https://colab.research.google.com/github/mjkurniawan/datacamp_python_track/blob/master/Tugas_Hari_2_Pekan_2_MJ_Kurniawan.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [84]:
# Persiapan membuat data
import pandas as pd
import random

pelajaran = ['Matematika', 'Fisika', 'Biologi', 'Kimia', 'Geologi', 'Ekonomi']
kelas = ['12A', '12B', '12C', '12D']

hasil_nilai = {
    'siswa_id' : range(1, 21),
    'pelajaran' : [random.choice(pelajaran) for i in range(20)],
    'nilai' : [random.choice(range(0, 100)) for i in range(20)],
    'jenis-kelamin' : [random.choice(['laki-laki', 'perempuan']) for i in range(20)],
    'kelas' : [random.choice(kelas) for i in range(20)]
}

df = pd.DataFrame(hasil_nilai)
df.head()

   siswa_id   pelajaran  nilai jenis-kelamin kelas
0         1     Biologi     49     laki-laki   12A
1         2     Geologi      0     laki-laki   12B
2         3     Ekonomi      4     perempuan   12B
3         4       Kimia      4     laki-laki   12B
4         5  Matematika     71     perempuan   12B

<h2>Soal 1: Indexing</h2>

1. Lakukan indexing terhadap dataframe untuk mengakses column nilai dan kelas saja
2. Lakukan indexing terhadap dataframe untuk mengakses row 5 sampai 10 beserta column pelajaran dan nilai

In [85]:
# code here
col_labels = ['nilai', 'kelas']
df[col_labels]

    nilai kelas
0      49   12A
1       0   12B
2       4   12B
3       4   12B
4      71   12B
5       0   12A
6      22   12B
7      85   12B
8      92   12D
9      85   12D
10     30   12A
11     14   12A
12     88   12B
13     92   12A
14      5   12C
15     75   12D
16     81   12D
17     38   12C
18     91   12C
19     28   12D

In [86]:
df.iloc[5:11, 1:3]

     pelajaran  nilai
5   Matematika      0
6   Matematika     22
7        Kimia     85
8      Biologi     92
9      Biologi     85
10       Kimia     30

<h2>Soal 2: Filter DataFrame Dengan Boolean</h2>

1. Tampilkan semua data siswa pada mata pelajaran Ekonomi dan Fisika
2. Tampilkan semua data siswa yang mempunyai nilai lebih dari 50 di mata pelajaran Kimia 
3. Tampilkan semua data yang mempunyai nilai lebih dari 70, berjnis kelamin perempuan dan di kelas 12C

In [87]:
# code here
# bolean series pelajaran Ekonomi
pel_ekonomi = df.pelajaran == 'Ekonomi'
# boolean series pelajaran Fisika
pel_fisika = df.pelajaran == 'Fisika'

print(df[(pel_ekonomi | pel_fisika)])

    siswa_id pelajaran  nilai jenis-kelamin kelas
2          3   Ekonomi      4     perempuan   12B
12        13   Ekonomi     88     perempuan   12B
14        15   Ekonomi      5     perempuan   12C
17        18    Fisika     38     laki-laki   12C

In [88]:
# bolean series nilai lebih dari 50
lebih_50 = df.nilai > 50
# boolean series pelajaran Kimia
pel_kimia = df.pelajaran == 'Kimia'

print(df[(pel_kimia) & (lebih_50)])

    siswa_id pelajaran  nilai jenis-kelamin kelas
7          8     Kimia     85     perempuan   12B
18        19     Kimia     91     perempuan   12C

In [92]:
# bolean series nilai lebih dari 70
lebih_70 = df.nilai > 70
# boolean series jenis kelamin Perempuan
jk_perempuan = df['jenis-kelamin'] == 'perempuan'
# boolean series kelas 12C
kls = df.kelas == '12C'

print(df[(lebih_70) & (jk_perempuan) & (kls)])

    siswa_id pelajaran  nilai jenis-kelamin kelas
18        19     Kimia     91     perempuan   12C

<h2>Soal 3: Data Transformation</h2>

lakukan data transformasi terhadap column 'nilai' dengan fungsi transformasi, berikut rumus dari normalisasi

![alt text](https://drive.google.com/uc?id=1wed-EbRSTA0JP1ceDp6lcKBqH2yJ4aa3)

In [101]:
df['nilai']

0     49
1      0
2      4
3      4
4     71
5      0
6     22
7     85
8     92
9     85
10    30
11    14
12    88
13    92
14     5
15    75
16    81
17    38
18    91
19    28
Name: nilai, dtype: int64

In [102]:
df.nilai.min()

0

In [104]:
df.nilai.max()

92

In [118]:
# code here
def normalized(x):
    z = (x - x.min()) / (x.max() - x.min())
    return z

df[['nilai']].apply(normalized)

       nilai
0   0.532609
1   0.000000
2   0.043478
3   0.043478
4   0.771739
5   0.000000
6   0.239130
7   0.923913
8   1.000000
9   0.923913
10  0.326087
11  0.152174
12  0.956522
13  1.000000
14  0.054348
15  0.815217
16  0.880435
17  0.413043
18  0.989130
19  0.304348

In [123]:
df['nilai_normalization'] = df[['nilai']].apply(normalized)
df

    siswa_id   pelajaran  nilai jenis-kelamin kelas  nilai_normalization
0          1     Biologi     49     laki-laki   12A             0.532609
1          2     Geologi      0     laki-laki   12B             0.000000
2          3     Ekonomi      4     perempuan   12B             0.043478
3          4       Kimia      4     laki-laki   12B             0.043478
4          5  Matematika     71     perempuan   12B             0.771739
5          6  Matematika      0     laki-laki   12A             0.000000
6          7  Matematika     22     laki-laki   12B             0.239130
7          8       Kimia     85     perempuan   12B             0.923913
8          9     Biologi     92     perempuan   12D             1.000000
9         10     Biologi     85     laki-laki   12D             0.923913
10        11       Kimia     30     laki-laki   12A             0.326087
11        12       Kimia     14     laki-laki   12A             0.152174
12        13     Ekonomi     88     perempuan   12B             0.956522
13        14     Biologi     92     laki-laki   12A             1.000000
14        15     Ekonomi      5     perempuan   12C             0.054348
15        16  Matematika     75     perempuan   12D             0.815217
16        17  Matematika     81     perempuan   12D             0.880435
17        18      Fisika     38     laki-laki   12C             0.413043
18        19       Kimia     91     perempuan   12C             0.989130
19        20     Geologi     28     laki-laki   12D             0.304348